#!/usr/bin/python
# -*- coding: utf-8 -*-


RESULTS = {
	'Політичні переконання': {
		'Диктатор': """
			Диктатура — необмежена влада в державі особи, групи осіб, суспільної верстви,
			що на відміну від демократії, тримається не на вільних і незалежних виборах, 
			а спирається на силові структури та органи держави чи навіть на пряме насильство, 
			репресії та терор. Тепер диктатурою, зазвичай, називають режим влади однієї особи або групи 
			осіб, не обмежений нормами законодавства, не стримуваний будь-якими громадськими чи 
			політичними інститутами.""",
		'Комуніст': """
			Комунізм - політична ідеологія, заснована на ідеї суспільства загальної рівності та свободи, 
			суспільної власності на засоби виробництва та безгрошового перерозподіла майна. В наш час, з 
			точки зору власної апологетики, комунізм — це суспільний лад (або особлива суспільно-економічна формація), 
			що ґрунтується на усуспільненні засобів виробництва; це також наукове і філософське вчення про 
			майбутнє безкласове суспільство, в якому відсутня приватна власність на засоби виробництва та 
			експлуатація людини людиною; а також це практика втілення цього вчення у життя.""",
		'Соціаліст': """
			Під терміном соціалізм у першу чергу розуміють: соціально-економічні ідеї, «вчення» та 
			ідеології, основним гаслом яких є соціальна справедливість, політичні рухи, різноманітні 
			утворення та партії, що в Новітній час відносять до «лівого» політичного спектру,
    		в переносному значенні в політичній лексиці — політика економічного перерозподілу національного 
    		продукту країни, спрямована на соціальний захист найслабших верств населення, підтримка бідних 
    		за рахунок багатих.""",
    	'Соціал-демократ': """
    		В цілому, соціал-демократи підтримують принципи справедливості, свободи, рівності та братерства. 
    		Соціал-демократія відділилась від соціалістичного руху в другій половині XIX століття й досі має 
    		вплив у всьому світі. Концепція соціал-демократії зазнала змін з часів появи. Основною відмінністю 
    		ідеології соціал-демократії та інших проявів соціалізму, таких як ортодоксальний марксизм, є віра 
    		у верховенство політичної дії на противагу верховенству економічної дії або економічний детермінізм.
    		""",
		'Ліберал': """Лібералізм проголошує, що ініціативна (активна), вільна, тобто неконтрольована 
			діяльність осіб, головним чином економічна й політична, є справжнім джерелом поступу в 
			суспільному житті. Спрямований на утвердження парламентського ладу, вільного підприємництва, 
			демократичних свобод, відстоює абсолютну цінність людської особистості (особа важливіша за державу) 
			та рівність всіх людей щодо прав особистості. Метою лібералізму є максимальне послаблення 
			різних форм державного і суспільного примусу щодо особи (контролю особи тощо).""",
		'Лібертаріанець': """Лібертаріанство пропагує ідею індивідуальної свободи та мінімізації розміру державного 
			апарату. Частина лібертаріанців розглядають такі форми державного втручання, як оподаткування та 
			втручання держави в економіку, як приклад крадіжки та грабунку, й тому виступають за їх скасування. 
			Захист громадян від насильства, на їхню думку, повинен здійснюватися приватними охоронними агенціями, 
			а допомога незаможним повинна здійснюватися на засадах добродійності.""",
	}
}


def calculate_answers(total_value):
	if total_value < -17:
		political_beliefs = 'Диктатор'
	elif -17 <= total_value < -10:
		political_beliefs = 'Комуніст'
	elif -10 <= total_value < -3:
		political_beliefs = 'Соціаліст'
	elif -3 <= total_value < 5:
		political_beliefs = 'Соціал-демократ'
	elif 5 <= total_value < 15:
		political_beliefs = 'Ліберал'
	else:
		political_beliefs = 'Лібертаріанець'
	return {'result': political_beliefs, 'description': RESULTS['Політичні переконання'][political_beliefs]}
