#!/usr/bin/python
# -*- coding: utf-8 -*-
from django.conf import settings

RESULTS = {
    'Політичні переконання': {
        'Диктатор': {'description' :"""
            Диктатура — необмежена влада в однієї особи, групи осіб, суспільної верстви,
            що на відміну від демократії, тримається не на вільних і незалежних виборах, 
            а спирається на силові структури та органи держави чи навіть на пряме насильство, 
            репресії та терор. Тепер диктатурою, зазвичай, називають режим влади однієї особи або групи 
            осіб, не обмежений нормами законодавства, не стримуваний будь-якими громадськими чи 
            політичними інститутами.""", 'logo': '%simg/dictatorship.jpg' % settings.STATIC_URL},
        'Комуніст': {'description': """
            Комунізм - політична ідеологія, заснована на ідеї суспільства загальної рівності та свободи, 
            суспільної власності на засоби виробництва та безгрошового перерозподілу майна. В наш час, з 
            точки зору власної апологетики, комунізм — це суспільний лад (або особлива суспільно-економічна формація), 
            що ґрунтується на усуспільненні засобів виробництва. Це також наукове і філософське вчення про 
            майбутнє безкласове суспільство, в якому відсутня приватна власність на засоби виробництва та 
            експлуатація людини людиною.""", 'logo': '%simg/communism.jpg' % settings.STATIC_URL},
        'Соціаліст': {'description': """
            Під терміном соціалізм у першу чергу розуміють: соціально-економічні ідеї, «вчення» та 
            ідеології, основним гаслом яких є соціальна справедливість. Політичні рухи, різноманітні 
            утворення та партії, що в Новітній час відносять до «лівого» політичного спектру,
            в переносному значенні в політичній лексиці — політика економічного перерозподілу національного 
            продукту країни, спрямована на соціальний захист найслабших верств населення, підтримка бідних 
            за рахунок багатих.""", 'logo': '%simg/socialism.jpg' % settings.STATIC_URL},
        'Соціал-демократ': {'description': """
            В цілому, соціал-демократи підтримують принципи справедливості, свободи, рівності та братерства. 
            Для цього необхідна відповідна  нормативно-правова база та механізми забезпечення основних прав людини 
            - таких, приміром як свобода слова. Соціал-демократичний підхід розглядає соціалізм як суспільний лад, 
            який досягається не в результаті революційної ліквідації капіталізму, а шляхом його реформування зі 
            збереженням приватної власності, забезпечення росту середнього класу, досягненням вищого рівня політичної, 
            соціальної, економічної свободи, соціальної рівності та справедливості.
            """, 'logo': '%simg/social-democracy.jpg' % settings.STATIC_URL},
        'Ліберал': {'description': """Лібералізм проголошує, що ініціативна (активна), вільна, тобто неконтрольована 
            діяльність осіб, головним чином економічна й політична, є справжнім джерелом поступу в 
            суспільному житті. Спрямований на утвердження парламентського ладу, вільного підприємництва, 
            демократичних свобод, відстоює абсолютну цінність людської особистості (особа важливіша за державу) 
            та рівність всіх людей щодо прав особистості. Метою лібералізму є максимальне послаблення 
            різних форм державного і суспільного примусу щодо особи (контролю особи тощо).""",
            'logo': '%simg/liberalism.png' % settings.STATIC_URL},
        'Лібертаріанець':{'description': """Лібертаріанство пропагує ідею індивідуальної свободи та мінімізації розміру державного 
            апарату. Частина лібертаріанців розглядають такі форми державного втручання, як оподаткування та 
            втручання держави в економіку, як приклад крадіжки та грабунку, й тому виступають за їх скасування. 
            Захист громадян від насильства, на їхню думку, повинен здійснюватися приватними охоронними агенціями, 
            а допомога незаможним повинна здійснюватися на засадах добродійності.""",
            'logo': '%simg/libertarian.png' % settings.STATIC_URL},
    }
}


def calculate_answers(total_value):
    if total_value < -17:
        political_beliefs = 'Диктатор'
    elif -17 <= total_value < -10:
        political_beliefs = 'Комуніст'
    elif -10 <= total_value < -3:
        political_beliefs = 'Соціаліст'
    elif -3 <= total_value < 5:
        political_beliefs = 'Соціал-демократ'
    elif 5 <= total_value < 15:
        political_beliefs = 'Ліберал'
    else:
        political_beliefs = 'Лібертаріанець'
    return {'result': political_beliefs,
        'info': RESULTS['Політичні переконання'][political_beliefs]}
